1.Display the first 10 rows and last 5 rows of the dataset.

2.Check:

a.number of rows

b.number of columns

c.column names

d.data types

3.Show summary statistics for numerical columns.

4.Find how many unique departments are there.

5.Count how many employees are active (is_active = True).

6.Find the minimum, maximum, and average salary.

7.Rename column experience_years to experience.

8.Change all column names to lowercase.

9.Check if there are any duplicate rows.

10.Check if any column has null values.

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("Dataset.csv")

In [3]:
# 1.
# display first 10 row of the dataframe
print(data.head(10))
print()
# display last 5 row of the data frame
print(data.tail(5))

   id  age  salary department  experience_years        city  \
0   1   56   28392      Sales                15    Lalitpur
1   2   46   50535         HR                18      Butwal
2   3   32   98603         HR                 3   Kathmandu
3   4   25   72256    Finance                 2      Butwal
4   5   38  109135         IT                16  Biratnagar
5   6   56   55222      Sales                16      Butwal
6   7   36   97373  Marketing                11   Kathmandu
7   8   40   99575         IT                13  Biratnagar
8   9   28  116354  Marketing                 5      Butwal
9  10   28  104651    Finance                 2  Biratnagar

   performance_score  bonus  gender  is_active
0               3.02  14216    Male       True
1               4.31   7132  Female       True
2               2.28   8891  Female       True
3               4.58  11700    Male      False
4               2.56   3779    Male       True
5               1.04   1924    Male       True
6               4.62  12148  Female       True
7               1.37   2581  Female      False
8               2.28   8714  Female       True
9               4.80   4324  Female      False

     id  age  salary department  experience_years       city  \
95   96   59  105616      Sales                 6  Kathmandu
96   97   56  113264         HR                 4   Lalitpur
97   98   58   46736  Marketing                 2  Kathmandu
98   99   45  114209         HR                11  Kathmandu
99  100   24   20854      Sales                15  Kathmandu

    performance_score  bonus  gender  is_active
95               1.31   5719  Female       True
96               4.90   3814  Female      False
97               4.94   4374    Male      False
98               3.79  12470  Female      False
99               3.14   2252  Female      False

In [4]:
# 2.
# Display all the information of DataFrame
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 100 non-null    int64
 1   age                100 non-null    int64
 2   salary             100 non-null    int64
 3   department         100 non-null    object
 4   experience_years   100 non-null    int64
 5   city               100 non-null    object
 6   performance_score  100 non-null    float64
 7   bonus              100 non-null    int64
 8   gender             100 non-null    object
 9   is_active          100 non-null    bool
dtypes: bool(1), float64(1), int64(5), object(3)
memory usage: 7.3+ KB
None

In [5]:
# 3.Show summary statistics for numerical columns.
# display all the statistics summary of DataFrame which has neumerical values
print(data.describe())

               id         age         salary  experience_years  \
count  100.000000  100.000000     100.000000        100.000000
mean    50.500000   37.910000   74788.380000          9.350000
std     29.011492   12.219454   29763.175128          6.092511
min      1.000000   18.000000   20206.000000          0.000000
25%     25.750000   26.750000   46578.250000          4.000000
50%     50.500000   38.000000   75932.000000          9.500000
75%     75.250000   46.250000  100700.500000         15.000000
max    100.000000   59.000000  118806.000000         19.000000

       performance_score         bonus
count         100.000000    100.000000
mean            3.072800   7929.210000
std             1.255892   4026.404957
min             1.040000   1009.000000
25%             2.117500   4852.750000
50%             3.125000   8165.000000
75%             4.162500  11200.250000
max             4.970000  14772.000000

In [6]:
# 4.Find how many unique departments are there.

data.value_counts("department")

department
Finance      26
HR           26
Marketing    23
IT           13
Sales        12
Name: count, dtype: int64

In [7]:
# 5.
# count how many are active, count true value
data.value_counts("is_active" )

is_active
True     53
False    47
Name: count, dtype: int64

In [8]:
# 6.Find the minimum, maximum, and average salary.

minimum_salary = data['salary'].min()
print("minimum salary",minimum_salary)
print("maximum salary",data['salary'].max())
print("Average salary",data['salary'].mean())

minimum salary 20206
maximum salary 118806
Average salary 74788.38

In [ ]:
# 7.Rename column experience_years to experience.


renam= data.rename(columns={"experience_years":"experience"})
print(renam)

     id  age  salary department  experience        city  performance_score  \
0     1   56   28392      Sales          15    Lalitpur               3.02
1     2   46   50535         HR          18      Butwal               4.31
2     3   32   98603         HR           3   Kathmandu               2.28
3     4   25   72256    Finance           2      Butwal               4.58
4     5   38  109135         IT          16  Biratnagar               2.56
..  ...  ...     ...        ...         ...         ...                ...
95   96   59  105616      Sales           6   Kathmandu               1.31
96   97   56  113264         HR           4    Lalitpur               4.90
97   98   58   46736  Marketing           2   Kathmandu               4.94
98   99   45  114209         HR          11   Kathmandu               3.79
99  100   24   20854      Sales          15   Kathmandu               3.14

    bonus  gender  is_active
0   14216    Male       True
1    7132  Female       True
2    8891  Female       True
3   11700    Male      False
4    3779    Male       True
..    ...     ...        ...
95   5719  Female       True
96   3814  Female      False
97   4374    Male      False
98  12470  Female      False
99   2252  Female      False

[100 rows x 10 columns]

In [11]:
data.value_counts()

id   age  salary  department  experience_years  city        performance_score  bonus  gender  is_active
1    56   28392   Sales       15                Lalitpur    3.02               14216  Male    True         1
2    46   50535   HR          18                Butwal      4.31               7132   Female  True         1
3    32   98603   HR          3                 Kathmandu   2.28               8891   Female  True         1
4    25   72256   Finance     2                 Butwal      4.58               11700  Male    False        1
5    38   109135  IT          16                Biratnagar  2.56               3779   Male    True         1
                                                                                                          ..
96   59   105616  Sales       6                 Kathmandu   1.31               5719   Female  True         1
97   56   113264  HR          4                 Lalitpur    4.90               3814   Female  False        1
98   58   46736   Marketing   2                 Kathmandu   4.94               4374   Male    False        1
99   45   114209  HR          11                Kathmandu   3.79               12470  Female  False        1
100  24   20854   Sales       15                Kathmandu   3.14               2252   Female  False        1
Name: count, Length: 100, dtype: int64

In [14]:
# 8.Change all column names to lowercase.

low= data.columns.str.lower()
print(low)
upr= data.columns.str.upper()
print(upr)

Index(['id', 'age', 'salary', 'department', 'experience_years', 'city',
       'performance_score', 'bonus', 'gender', 'is_active'],
      dtype='object')
Index(['ID', 'AGE', 'SALARY', 'DEPARTMENT', 'EXPERIENCE_YEARS', 'CITY',
       'PERFORMANCE_SCORE', 'BONUS', 'GENDER', 'IS_ACTIVE'],
      dtype='object')

In [18]:
# 9.Check if there are any duplicate rows.


duplicate_value = data.duplicated().sum()
print(duplicate_value)

0

In [20]:
# 10.Check if any column has null values.

nullvalue= data.isnull().sum()

print(nullvalue)

id                   0
age                  0
salary               0
department           0
experience_years     0
city                 0
performance_score    0
bonus                0
gender               0
is_active            0
dtype: int64